paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/test/src/ut_network.c
/* Copyright (c) 2010 - 2017, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdlib.h>

#include <unity.h>
#include <cmock.h>

#include "nrf_mesh.h"

#include "beacon.h"
#include "log.h"
#include "network.h"
#include "packet_mgr.h"
#include "timer.h"
#include "toolchain.h"
#include "utils.h"

#include "bearer_mock.h"
#include "event_mock.h"
#include "msg_cache_mock.h"
#include "transport_mock.h"
#include "net_beacon_mock.h"
#include "net_state_mock.h"

/*************** Static Test Parameters ***************/

#define TEST_APPLICATION_KEY { 0x63, 0x96, 0x47, 0x71, 0x73, 0x4f, 0xbd, 0x76, 0xe3, 0xb4, 0x05, 0x19, 0xd1, 0xd9, 0x4a, 0x48 }
#define TEST_NETWORK_KEY     { 0x7d, 0xd7, 0x36, 0x4c, 0xd8, 0x42, 0xad, 0x18, 0xc1, 0x7c, 0x2b, 0x82, 0x0c, 0x84, 0xc3, 0xd6 }
#define TEST_DEVICE_KEY      { 0x9d, 0x6d, 0xd0, 0xe9, 0x6e, 0xb2, 0x5d, 0xc1, 0x9a, 0x40, 0xed, 0x99, 0x14, 0xf8, 0xf0, 0x3f }

/* Parameters for the encryption test: */
#define TEST_PRIVACY_KEY     { 0x8b, 0x84, 0xee, 0xde, 0xc1, 0x00, 0x06, 0x7d, 0x67, 0x09, 0x71, 0xdd, 0x2a, 0xa7, 0x00, 0xcf }
#define TEST_ENCRYPTION_KEY  { 0x09, 0x53, 0xfa, 0x93, 0xe7, 0xca, 0xac, 0x96, 0x38, 0xf5, 0x88, 0x20, 0x22, 0x0a, 0x39, 0x8e }
#define TEST_NETWORK_ID      { 0x3e, 0xca, 0xff, 0x67, 0x2f, 0x67, 0x33, 0x70 }
#define TEST_NID               0x68
#define TEST_IV_INDEX          0x12345678

/* Beacon test packets */
#define TEST_BEACON_NORMAL              { 0x00, 0x3e, 0xca, 0xff, 0x67, 0x2f, 0x67, 0x33, 0x70, 0x12, 0x34, 0x56, 0x78, 0x8e, 0xa2, 0x61, 0x58, 0x2f, 0x36, 0x4f, 0x6f }
#define TEST_BEACON_IV_UPDATE           { 0x02, 0x3e, 0xca, 0xff, 0x67, 0x2f, 0x67, 0x33, 0x70, 0x12, 0x34, 0x56, 0x79, 0xc2, 0xaf, 0x80, 0xad, 0x07, 0x2a, 0x13, 0x5c }
#define TEST_BEACON_IV_UPDATE_COMPLETE  { 0x00, 0x3e, 0xca, 0xff, 0x67, 0x2f, 0x67, 0x33, 0x70, 0x12, 0x34, 0x56, 0x79, 0xc6, 0x2f, 0x09, 0xe4, 0xc9, 0x57, 0xf5, 0x9d }

/*************** Test Vectors ***************/

/* Macro for specifying the complete, encrypted network packet. In the spec, this data is labelled "NetworkPDU". */
#define TEST_PACKET_ENCRYPTED(p_vector, ...) \
            { \
                static const uint8_t buffer[] = { __VA_ARGS__ }; \
                p_vector->p_encrypted_packet = buffer; \
                p_vector->lengths.encrypted = sizeof(buffer); \
            }
/* Macro for specifying the transport packet. In the spec, this data is labelled "TransportPDU". */
#define TEST_PACKET_TRANSPORT(p_vector, ...) \
            { \
                static const uint8_t buffer[] = { __VA_ARGS__ }; \
                p_vector->p_transport_packet = buffer; \
                p_vector->lengths.transport = sizeof(buffer); \
            }
/*
 * Macro for specifying the unencrypted header data. This is a concatenation of the fields "IVI NID", "CTL TTL",
 * SEQ, SRC and DST in the specification sample data.
 */
#define TEST_PACKET_HEADER(p_vector, ...) \
            { \
                static const uint8_t buffer[] = { __VA_ARGS__ }; \
                p_vector->p_header_data = buffer; \
                p_vector->lengths.header = sizeof(buffer); \
            }
/* Macro for specifying metadata about a test packet. */
#define TEST_PACKET_PARAMS(p_vector, iv, sequence, src, dst, ttl_, ctl_, miclen_) \
            { \
                p_vector->params.iv_index = iv; \
                p_vector->params.seqnum = sequence; \
                p_vector->params.source = src; \
                p_vector->params.dest   = dst; \
                p_vector->params.ttl    = ttl_; \
                p_vector->params.ctl    = ctl_; \
                p_vector->params.miclen = miclen_; \
            }

typedef struct
{
    uint32_t iv_index;
    uint32_t seqnum : 24;
    uint16_t source;
    uint16_t dest;
    uint8_t  ttl    : 7;
    uint8_t  ctl    : 1;
    uint8_t  miclen;
} test_packet_params_t;

typedef struct
{
    const uint8_t * p_encrypted_packet; /* Complete, encrypted packet. */
    const uint8_t * p_transport_packet; /* Transport packet (encrypted) passed from network to transport. */
    const uint8_t * p_header_data;      /* Unobfuscated packet header. */

    test_packet_params_t params;        /* Metadata describing the packet. */

    struct
    {
        uint8_t encrypted;
        uint8_t transport;
        uint8_t header;
    } lengths;
} test_vector_t;

/* Specifies all available test vectors; corresponds to sample data in the spec, see below: */
#define TEST_VECTORS_AVAILABLE       { 1, 2, 3, 6, 7, 8, 9, 16, 17, 18, 19, 20, 21, 22, 23, 24}

