paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/test/src/ut_network.c
/* Specifies which sets of test vectors to use for specific tests: */
#define NETWORK_PKT_IN_TEST_VECTORS        TEST_VECTORS_AVAILABLE
#define SELF_RECEIVE_TEST_VECTORS          TEST_VECTORS_AVAILABLE
#define NETWORK_PKT_OUT_TEST_VECTORS       { 1, 2, 3, 6, 7, 8, 9, 16, 16, 18, 19 /* Skip cases with other IV indices */ }
#define INVALID_NETKEY_TEST_VECTORS        TEST_VECTORS_AVAILABLE
#define NETWORK_PKT_RELAY_TEST_VECTORS     TEST_VECTORS_AVAILABLE

/*
 * Retrieves a test vector. These are indexed by the number used in the specification,
 * currently version Mesh_d09r12-rh-ba-ss-pw.docx. Some test vectors are skipped, as they use
 * friendship credentials, which we don't support.
 */
static void get_test_vector(unsigned int vector, test_vector_t * p_vector)
{
    switch(vector)
    {
        case 1:
        {
            TEST_PACKET_ENCRYPTED(p_vector, 0x68, 0xec, 0xa4, 0x87, 0x51, 0x67, 0x65, 0xb5, 0xe5, 0xbf, 0xda, 0xcb,
                    0xaf, 0x6c, 0xb7, 0xfb, 0x6b, 0xff, 0x87, 0x1f, 0x03, 0x54, 0x44, 0xce, 0x83, 0xa6, 0x70, 0xdf);
            TEST_PACKET_TRANSPORT(p_vector, 0x03, 0x4b, 0x50, 0x05, 0x7e, 0x40, 0x00, 0x00, 0x01, 0x00, 0x00);
            TEST_PACKET_HEADER(p_vector, 0x68, 0x80, 0x00, 0x00, 0x01, 0x12, 0x01, 0xff, 0xfd);
            TEST_PACKET_PARAMS(p_vector, 0x12345678, 0x000001, 0x1201, 0xfffd, 0, 1, 8);
            break;
        }
        case 2:
        {
            TEST_PACKET_ENCRYPTED(p_vector, 0x68, 0xd4, 0xc8, 0x26, 0x29, 0x6d, 0x79, 0x79, 0xd7, 0xdb, 0xc0, 0xc9, 0xb4,
                0xd4, 0x3e, 0xeb, 0xec, 0x12, 0x9d, 0x20, 0xa6, 0x20, 0xd0, 0x1e);
            TEST_PACKET_TRANSPORT(p_vector, 0x04, 0x32, 0x03, 0x08, 0xba, 0x07, 0x2f);
            TEST_PACKET_HEADER(p_vector, 0x68, 0x80, 0x01, 0x48, 0x20, 0x23, 0x45, 0x12, 0x01);
            TEST_PACKET_PARAMS(p_vector, 0x12345678, 0x014820, 0x2345, 0x1201, 0, 1, 8);
            break;
        }
        case 3:
        {
            TEST_PACKET_ENCRYPTED(p_vector, 0x68, 0xda, 0x06, 0x2b, 0xc9, 0x6d, 0xf2, 0x53, 0x27, 0x30, 0x86, 0xb8, 0xc5,
                0xee, 0x00, 0xbd, 0xd9, 0xcf, 0xcc, 0x62, 0xa2, 0xdd, 0xf5, 0x72);
            TEST_PACKET_TRANSPORT(p_vector, 0x04, 0xfa, 0x02, 0x05, 0xa6, 0x00, 0x0a);
            TEST_PACKET_HEADER(p_vector, 0x68, 0x80, 0x2b, 0x38, 0x32, 0x2f, 0xe3, 0x12, 0x01);
            TEST_PACKET_PARAMS(p_vector, 0x12345678, 0x2b3832, 0x2fe3, 0x1201, 0, 1, 8);
            break;
        }
        case 6:
        {
            /* Test message #6 contains two messages, only the first one is included here. */
            TEST_PACKET_ENCRYPTED(p_vector, 0x68, 0xca, 0xb5, 0xc5, 0x34, 0x8a, 0x23, 0x0a, 0xfb, 0xa8, 0xc6, 0x3d,
                    0x4e, 0x68, 0x16, 0x31, 0xc0, 0x9d, 0xea, 0xf4, 0xfd, 0x40, 0x96, 0x11, 0x45, 0x9a, 0x3d, 0x6c, 0x3e);
            TEST_PACKET_TRANSPORT(p_vector, 0x80, 0x26, 0xac, 0x01, 0xee, 0xe8, 0x88, 0xaa, 0x21, 0x69, 0x32, 0x6d, 0x23, 0xf3, 0xaf, 0xdf);
            TEST_PACKET_HEADER(p_vector, 0x68, 0x04, 0x31, 0x29, 0xab, 0x00, 0x03, 0x12, 0x01);
            TEST_PACKET_PARAMS(p_vector, 0x12345678, 0x3129ab, 0x0003, 0x1201, 4, 0, 4);
            break;
        }
        case 7:
        {
            TEST_PACKET_ENCRYPTED(p_vector, 0x68, 0xe4, 0x76, 0xb5, 0x57, 0x9c, 0x98, 0x0d, 0x0d, 0x73, 0x0f, 0x94, 0xd7,
                    0xf3, 0x50, 0x9d, 0xf9, 0x87, 0xbb, 0x41, 0x7e, 0xb7, 0xc0, 0x5f);
            TEST_PACKET_TRANSPORT(p_vector, 0x00, 0xa6, 0xac, 0x00, 0x00, 0x00, 0x02);
            TEST_PACKET_HEADER(p_vector, 0x68, 0x8b, 0x01, 0x48, 0x35, 0x23, 0x45, 0x00, 0x03);
            TEST_PACKET_PARAMS(p_vector, 0x12345678, 0x014835, 0x2345, 0x0003, 0x0b, 1, 8);
            break;
        }
        case 8:
        {
            TEST_PACKET_ENCRYPTED(p_vector, 0x68, 0xcd, 0x99, 0x59, 0xf2, 0x8d, 0xa7, 0x0e, 0x2f, 0x91, 0xad, 0xd6, 0xf0,
                    0x6c, 0x13, 0x55, 0x3f, 0x44, 0xce, 0xc9, 0x7f, 0x97, 0x31, 0x05, 0xae, 0xbb, 0xc5, 0x82, 0x04);
            TEST_PACKET_TRANSPORT(p_vector, 0x80, 0x26, 0xac, 0x01, 0xec, 0xe8, 0x88, 0xaa, 0x21, 0x69, 0x32, 0x6d, 0x23, 0xf3, 0xaf, 0xdf);
            TEST_PACKET_HEADER(p_vector, 0x68, 0x04, 0x31, 0x29, 0xad, 0x00, 0x03, 0x12, 0x01);
            TEST_PACKET_PARAMS(p_vector, 0x12345678, 0x3129ad, 0x0003, 0x1201, 0x4, 0, 4);
            break;
        }
        case 9:
        {
            TEST_PACKET_ENCRYPTED(p_vector, 0x68, 0xae, 0xc4, 0x67, 0xed, 0x49, 0x01, 0xd8, 0x5d, 0x80, 0x6b, 0xbe, 0xd2,
                    0x48, 0x61, 0x4f, 0x93, 0x80, 0x67, 0xb0, 0xd9, 0x83, 0xbb, 0x7b);
            TEST_PACKET_TRANSPORT(p_vector, 0x00, 0xa6, 0xac, 0x00, 0x00, 0x00, 0x03);
            TEST_PACKET_HEADER(p_vector, 0x68, 0x8b, 0x01, 0x48, 0x36, 0x23, 0x45, 0x00, 0x03);
            TEST_PACKET_PARAMS(p_vector, 0x12345678, 0x014836, 0x2345, 0x0003, 0x0b, 1, 8);
            break;
        }
        case 16:
        {
            TEST_PACKET_ENCRYPTED(p_vector, 0x68, 0xd6, 0x03, 0x06, 0xde, 0x09, 0xe1, 0x6b, 0x9b, 0xe7, 0xe5, 0xf6, 0x42,
                    0x87, 0xac, 0xd1, 0x85, 0xad, 0x31, 0x5e, 0x1c, 0x7a, 0xc3, 0x82);
            TEST_PACKET_TRANSPORT(p_vector, 0x00, 0x99, 0x01, 0x1b, 0x84, 0x84, 0xff, 0x19, 0x5a, 0xf1, 0x8b);
            TEST_PACKET_HEADER(p_vector, 0x68, 0x0b, 0x00, 0x00, 0x06, 0x12, 0x01, 0x00, 0x03);
            TEST_PACKET_PARAMS(p_vector, 0x12345678, 0x000006, 0x1201, 0x0003, 0x0b, 0, 4);
            break;
        }
        case 17:
        {
            TEST_PACKET_ENCRYPTED(p_vector, 0x68, 0x64, 0x88, 0x42, 0xa9, 0xd6, 0x7f, 0x2a, 0x80, 0xd3, 0x91, 0xe9, 0x1f,
                    0xf7, 0x18, 0x83, 0xf5, 0xe8, 0xe0, 0x30, 0xf4, 0xc6, 0x66, 0x0b);
            TEST_PACKET_TRANSPORT(p_vector, 0x00, 0x99, 0x01, 0x1b, 0x84, 0x84, 0xff, 0x19, 0x5a, 0xf1, 0x8b);
            TEST_PACKET_HEADER(p_vector, 0x68, 0x0a, 0x00, 0x00, 0x06, 0x12, 0x01, 0x00, 0x03);
            TEST_PACKET_PARAMS(p_vector, 0x12345678, 0x000006, 0x1201, 0x0003, 0x0a, 0, 4);
            break;
        }
        case 18:
        {
            TEST_PACKET_ENCRYPTED(p_vector, 0x68, 0xb8, 0x6c, 0xea, 0xf4, 0xee, 0xf3, 0x56, 0x73, 0x20, 0x8a, 0x70, 0x7e,
                    0xba, 0x3c, 0x4b, 0xae, 0xc7, 0x78, 0x00, 0x9b, 0xeb, 0xf9, 0x7b, 0xf5, 0xcb);
            TEST_PACKET_TRANSPORT(p_vector, 0x34, 0x5a, 0x99, 0xdf, 0x6e, 0x95, 0x1e, 0x11, 0xc8, 0x10, 0xea, 0x77, 0x15);
            TEST_PACKET_HEADER(p_vector, 0x68, 0x03, 0x00, 0x00, 0x07, 0x12, 0x01, 0xff, 0xff);
            TEST_PACKET_PARAMS(p_vector, 0x12345678, 0x000007, 0x1201, 0xffff, 0x03, 0, 4);
            break;
        }
        case 19:
        {
            TEST_PACKET_ENCRYPTED(p_vector, 0x68, 0x34, 0x57, 0xbc, 0x49, 0x94, 0x69, 0x30, 0x10, 0xf2, 0x5e, 0x09, 0x22,
                    0xaa, 0x23, 0x05, 0x3e, 0xd0, 0x77, 0xa3, 0xe2, 0x2b, 0x53, 0x4d, 0x08, 0x34, 0x5a, 0xda);
            TEST_PACKET_TRANSPORT(p_vector, 0x34, 0xca, 0x7e, 0xd9, 0x8d, 0x6c, 0x8a, 0x11, 0x12, 0xde, 0xb9, 0x9d, 0x44, 0xec, 0x14);
            TEST_PACKET_HEADER(p_vector, 0x68, 0x03, 0x00, 0x00, 0x09, 0x12, 0x01, 0xff, 0xff);
            TEST_PACKET_PARAMS(p_vector, 0x12345678, 0x000009, 0x1201, 0xffff, 0x03, 0, 4);
            break;
        }
        case 20:
        {
            TEST_PACKET_ENCRYPTED(p_vector, 0xe8, 0x11, 0x92, 0xd0, 0x3c, 0xee, 0x53, 0x9a, 0x2c, 0xc3, 0x3a, 0x0d, 0xbe, 0x32, 0xfb, 0xb1, 0xb2, 0x36, 0x99);
            TEST_PACKET_TRANSPORT(p_vector, 0xb4, 0x20, 0x24, 0x21, 0xd8, 0x1a);
            TEST_PACKET_HEADER(p_vector, 0xe8, 0x03, 0x07, 0x08, 0x0a, 0x12, 0x34, 0xff, 0xff);
            TEST_PACKET_PARAMS(p_vector, 0x12345677, 0x07080a, 0x1234, 0xffff, 0x03, 0, 4); //(p_vector, iv, sequence, src, dst, ttl_, ctl_, miclen_)
            break;
        }
        case 21:
        {
            TEST_PACKET_ENCRYPTED(p_vector, 0xe8, 0xa5, 0x90, 0x0d, 0x85, 0xf9, 0x62, 0xe4, 0xd6, 0x43, 0x35, 0x8e, 0xaf,
                    0x17, 0x79, 0x6a, 0x6c, 0x98, 0x97, 0x7f, 0x69, 0xe5, 0x03, 0xf3, 0x95, 0x7f);
            TEST_PACKET_TRANSPORT(p_vector, 0x34, 0x2f, 0xa7, 0x30, 0xfd, 0x98, 0xf6, 0xe4, 0xbd, 0x12, 0x0e, 0xa9, 0xd6);
            TEST_PACKET_HEADER(p_vector, 0xe8, 0x03, 0x07, 0x08, 0x0a, 0x12, 0x34, 0x81, 0x05);
            TEST_PACKET_PARAMS(p_vector, 0x12345677, 0x07080a, 0x1234, 0x8105, 0x03, 0, 4);
            break;
        }
        case 22:
        {
            TEST_PACKET_ENCRYPTED(p_vector, 0xe8, 0x9b, 0x77, 0x27, 0xa0, 0x66, 0xdb, 0xed, 0x31, 0xa1, 0xfd, 0xcf, 0x88,
                    0xa4, 0x11, 0x13, 0x5f, 0xea, 0x55, 0xdf, 0x73, 0x0b, 0x33, 0x27, 0xdf, 0xae);
            TEST_PACKET_TRANSPORT(p_vector, 0x34, 0x38, 0x71, 0xb9, 0x04, 0xd4, 0x31, 0x52, 0x63, 0x16, 0xca, 0x48, 0xa0);
            TEST_PACKET_HEADER(p_vector, 0xe8, 0x03, 0x07, 0x08, 0x0b, 0x12, 0x34, 0xb5, 0x29);
            TEST_PACKET_PARAMS(p_vector, 0x12345677, 0x07080b, 0x1234, 0xb529, 0x03, 0, 4);
            break;
        }
        case 23:
        {
            TEST_PACKET_ENCRYPTED(p_vector, 0xe8, 0x28, 0x38, 0x23, 0xc0, 0xfb, 0xb5, 0x7a, 0x9d, 0x3b, 0x6d, 0x3d, 0xd1,
                    0x6a, 0x75, 0x48, 0x96, 0x96, 0xf0, 0xb7, 0x0c, 0x71, 0x45, 0xa3, 0x91, 0x0d);
            TEST_PACKET_TRANSPORT(p_vector, 0x34, 0x24, 0x56, 0xdb, 0x5e, 0x31, 0x00, 0xee, 0xf6, 0x5d, 0xaa, 0x7a, 0x38);
            TEST_PACKET_HEADER(p_vector, 0xe8, 0x03, 0x07, 0x08, 0x0c, 0x12, 0x34, 0x97, 0x36);
            TEST_PACKET_PARAMS(p_vector, 0x12345677, 0x07080c, 0x1234, 0x9736, 0x03, 0, 4);
            break;
        }
        case 24:
        {
            TEST_PACKET_ENCRYPTED(p_vector, 0xe8, 0xfa, 0xea, 0xac, 0x4c, 0x39, 0x2e, 0x94, 0xe9, 0x4a, 0xca, 0x29, 0x59,
                    0x3d, 0x70, 0x17, 0x2e, 0xdb, 0xda, 0xd5, 0x70, 0x6b, 0x6d, 0x9d, 0x66, 0x81);
            TEST_PACKET_TRANSPORT(p_vector, 0x34, 0xde, 0x15, 0x47, 0xb9, 0x16, 0x58, 0xf1, 0x61, 0x62, 0x74, 0xfe, 0x58);
            TEST_PACKET_HEADER(p_vector, 0xe8, 0x03, 0x07, 0x08, 0x0d, 0x12, 0x34, 0x97, 0x36);
            TEST_PACKET_PARAMS(p_vector, 0x12345677, 0x07080d, 0x1234, 0x9736, 0x03, 0, 4);
            break;
        }
        default:
            TEST_FAIL_MESSAGE("Unknown test vector requested!");
    }
}

/*************** Mesh Assertion Handling  ***************/

