paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/test/src/ut_network.c
nrf_mesh_assertion_handler_t m_assertion_handler;
void nrf_mesh_assertion_handler(uint32_t pc)
{
    TEST_FAIL_MESSAGE("Mesh assertion triggered!");
}

/*************** Static Variables and Stuff ***************/

static nrf_mesh_network_secmat_t test_network;
static uint32_t m_net_secmat_get_calls_expect;
static nrf_mesh_network_secmat_t * mp_net_secmats;
static uint32_t m_net_secmat_count;
static uint16_t m_rx_address;
static uint32_t m_relay_expected;

static uint16_t m_relay_src;
static uint16_t m_relay_dst;
static uint8_t m_relay_ttl;
static uint32_t m_relay_return;

static uint32_t m_bearer_tx_return;

/*************** Additional Mock Functions ***************/

timestamp_t timer_now(void)
{
    return 0;
}

static packet_net_t * p_transport_pkt_in_previous;

uint32_t transport_pkt_in_mock_cb(packet_net_t * p_packet, packet_meta_t * p_packet_meta, const nrf_mesh_network_secmat_t * const p_network, uint32_t iv_index, int cmock_num_calls)
{
    if(p_transport_pkt_in_previous != NULL)
    {
        free(p_transport_pkt_in_previous);
    }

    p_transport_pkt_in_previous = malloc(p_packet->length + 1 /* Add one to the length to account for the length field itself */);
    memcpy(p_transport_pkt_in_previous, p_packet, p_packet->length + 1);

    return NRF_SUCCESS;
}

static void transport_pkt_in_mock_reset(void)
{
    if(p_transport_pkt_in_previous != NULL)
    {
        free(p_transport_pkt_in_previous);
        p_transport_pkt_in_previous = NULL;
    }
}

static packet_t * p_bearer_tx_previous;

uint32_t bearer_tx_mock_cb(packet_t * p_packet, bearer_t bearers, uint8_t retransmit_count, int cmock_num_calls)
{
    if(p_bearer_tx_previous != NULL)
    {
        free(p_bearer_tx_previous);
    }

    p_bearer_tx_previous = malloc(sizeof(packet_t));
    memcpy(p_bearer_tx_previous, p_packet, packet_buffer_size_get(p_packet));

    return m_bearer_tx_return;
}

static void bearer_tx_mock_reset(void)
{
    if(p_bearer_tx_previous != NULL)
    {
        free(p_bearer_tx_previous);
        p_bearer_tx_previous = NULL;
    }
}

/*************** Static Helper Functions and Types ***************/

/*
 * Provisions the test network. Will use test vector keys if indicated, otherwise, it'll be dummies.
 */
static void provision(bool use_real_keys)
{
    if (use_real_keys)
    {
        uint8_t privacy[] = TEST_PRIVACY_KEY;
        uint8_t encryption[] = TEST_ENCRYPTION_KEY;
        test_network.nid = TEST_NID;
        memcpy(test_network.privacy_key, privacy, NRF_MESH_KEY_SIZE);
        memcpy(test_network.encryption_key, encryption, NRF_MESH_KEY_SIZE);
    }
    else
    {
        memset(test_network.privacy_key, 0x11, NRF_MESH_KEY_SIZE);
        memset(test_network.encryption_key, 0x22, NRF_MESH_KEY_SIZE);
        test_network.nid = 0x12;
    }
}

/* Constructs a complete BLE packet from the input payload. */
static packet_net_t * construct_in_packet(packet_t ** pp_packet, const uint8_t * p_payload, uint8_t payload_size)
{
    TEST_ASSERT_EQUAL(NRF_SUCCESS, packet_mgr_alloc((packet_generic_t **) pp_packet, sizeof(packet_t)));
    TEST_ASSERT_NOT_NULL(*pp_packet);

    packet_payload_size_set(*pp_packet, sizeof(packet_net_t) + payload_size);
    packet_ad_type_set(*pp_packet, AD_TYPE_MESH);
    packet_ad_length_set(*pp_packet, payload_size + BLE_AD_DATA_OVERHEAD);

    packet_net_t * p_net_packet = packet_net_packet_get(*pp_packet);
    TEST_ASSERT_NOT_NULL(*pp_packet);
    packet_net_payload_size_set(p_net_packet, payload_size - sizeof(p_net_packet->header));

    memcpy(&p_net_packet->header, p_payload, payload_size);

    return p_net_packet;
}

/* Constructs a packet containing the fields normally filled out by the transport layer. */
static packet_net_t * construct_out_packet(packet_t ** pp_packet, const uint8_t * p_payload, uint8_t payload_size, const test_packet_params_t * params)
{
    TEST_ASSERT_EQUAL(NRF_SUCCESS, packet_mgr_alloc((packet_generic_t **) pp_packet, sizeof(packet_t)));
    TEST_ASSERT_NOT_NULL(*pp_packet);

    packet_payload_size_set(*pp_packet, sizeof(packet_net_t) + payload_size + params->miclen);
    packet_ad_type_set(*pp_packet, AD_TYPE_MESH);
    packet_ad_length_set(*pp_packet, payload_size + BLE_AD_DATA_OVERHEAD);

    packet_net_t * p_net_packet = packet_net_packet_get(*pp_packet);
    packet_net_payload_size_set(p_net_packet, payload_size + params->miclen);
    memcpy(p_net_packet->payload, p_payload, payload_size);

    p_net_packet->header.seq = LE2BE24(params->seqnum);
    p_net_packet->header.src = LE2BE16(params->source);
    p_net_packet->header.dst = LE2BE16(params->dest);
    p_net_packet->header.ttl = params->ttl;
    p_net_packet->header.ctl = params->ctl;
    p_net_packet->header.ivi = params->iv_index & 0x01;
    p_net_packet->header.nid = test_network.nid;

    return p_net_packet;
}

void nrf_mesh_net_secmat_next_get(uint8_t nid, const nrf_mesh_network_secmat_t ** pp_secmat)
{
    TEST_ASSERT_TRUE(m_net_secmat_get_calls_expect > 0);
    TEST_ASSERT_NOT_NULL(mp_net_secmats);
    TEST_ASSERT_NOT_EQUAL(0, m_net_secmat_count);
    m_net_secmat_get_calls_expect--;

    if (*pp_secmat == NULL)
    {
        *pp_secmat = &mp_net_secmats[0];
    }
    else if ((uint32_t)(*pp_secmat - &mp_net_secmats[0]) >= m_net_secmat_count - 1)
    {
        *pp_secmat = NULL;
    }
    else
    {
        (*pp_secmat)++; /* get next */
    }
}

bool nrf_mesh_rx_address_get(uint16_t address, nrf_mesh_address_t * p_address)
{
    return (m_rx_address == address);
}

static bool relay_cb(uint16_t src, uint16_t dst, uint8_t ttl)
{
    TEST_ASSERT_TRUE(m_relay_expected > 0);
    TEST_ASSERT_EQUAL(src, m_relay_src);
    TEST_ASSERT_EQUAL(dst, m_relay_dst);
    TEST_ASSERT_EQUAL(ttl, m_relay_ttl);
    m_relay_expected--;
    return m_relay_return;
}
/*************** Test Initialization and Finalization ***************/

void setUp(void)
{
    CMOCK_SETUP(bearer);
    CMOCK_SETUP(msg_cache);
    CMOCK_SETUP(transport);
    CMOCK_SETUP(event);
    CMOCK_SETUP(net_state);
    CMOCK_SETUP(net_beacon);

    m_net_secmat_get_calls_expect = 0;
    mp_net_secmats = NULL;
    m_net_secmat_count = 0;
    m_rx_address = 0;
    m_bearer_tx_return = NRF_SUCCESS;

