paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/test/src/ut_network.c
    __LOG_INIT((LOG_SRC_NETWORK | LOG_SRC_ENC | LOG_SRC_TEST), 3, LOG_CALLBACK_DEFAULT);

    m_assertion_handler = nrf_mesh_assertion_handler;
    nrf_mesh_init_params_t init_params =
    {
        .assertion_handler = nrf_mesh_assertion_handler,
    };

    net_state_init_Expect();
    net_beacon_init_Expect();
    net_state_recover_from_flash_Expect();
    network_init(&init_params);
    packet_mgr_init(&init_params);
}

void tearDown(void)
{
    transport_pkt_in_mock_reset();
    bearer_tx_mock_reset();

    CMOCK_TEARDOWN();
}

/*************** Test Cases ***************/

void test_packet_in(void)
{
    const uint8_t run_testvectors[] = NETWORK_PKT_IN_TEST_VECTORS;
    provision(true);

    transport_pkt_in_StubWithCallback(transport_pkt_in_mock_cb);

    mp_net_secmats = &test_network;
    m_net_secmat_count = 1;

    /* Processes all the test vectors as incoming packets. */
    for(unsigned int i = 0; i < sizeof(run_testvectors); ++i)
    {
        test_vector_t test_vector;
        get_test_vector(run_testvectors[i], &test_vector);
        __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "Running test vector %d\n", run_testvectors[i]);

        packet_t * p_packet = NULL;
        packet_net_t * p_net_packet = construct_in_packet(&p_packet, test_vector.p_encrypted_packet, test_vector.lengths.encrypted);

        transport_pkt_in_mock_reset();

        msg_cache_entry_exists_IgnoreAndReturn(false);
        msg_cache_entry_add_Expect(LE2BE16(test_vector.params.source), test_vector.params.seqnum);

        m_net_secmat_get_calls_expect = 1;

        net_state_rx_iv_index_get_ExpectAndReturn(test_vector.params.iv_index & 0x01, test_vector.params.iv_index);

        TEST_ASSERT_EQUAL(NRF_SUCCESS, network_pkt_in(p_net_packet, NULL));
        TEST_ASSERT_NOT_NULL(p_transport_pkt_in_previous);

        TEST_ASSERT_EQUAL(0, m_net_secmat_get_calls_expect);

        TEST_ASSERT_EQUAL_MEMORY(test_vector.p_header_data,     &p_transport_pkt_in_previous->header, test_vector.lengths.header);
        TEST_ASSERT_EQUAL_MEMORY(test_vector.p_transport_packet, p_transport_pkt_in_previous->payload, test_vector.lengths.transport);

        packet_mgr_decref(p_packet);
    }

    /* Add more networks, make sure we hit the right one for all test vectors. */
    nrf_mesh_network_secmat_t secmats[4];
    memset(&secmats[0], 0x12, sizeof(nrf_mesh_network_secmat_t));
    memset(&secmats[1], 0x34, sizeof(nrf_mesh_network_secmat_t));
    memcpy(&secmats[2], &test_network, sizeof(nrf_mesh_network_secmat_t));
    memset(&secmats[3], 0x56, sizeof(nrf_mesh_network_secmat_t));
    mp_net_secmats = secmats;
    m_net_secmat_count = 4;

    for(unsigned int i = 0; i < sizeof(run_testvectors); ++i)
    {
        test_vector_t test_vector;
        get_test_vector(run_testvectors[i], &test_vector);
        __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "Running test vector %d\n", run_testvectors[i]);

        packet_t * p_packet = NULL;
        packet_net_t * p_net_packet = construct_in_packet(&p_packet, test_vector.p_encrypted_packet, test_vector.lengths.encrypted);

        transport_pkt_in_mock_reset();

        msg_cache_entry_exists_IgnoreAndReturn(false);
        msg_cache_entry_add_Expect(LE2BE16(test_vector.params.source), test_vector.params.seqnum);

        m_net_secmat_get_calls_expect = 3;

        net_state_rx_iv_index_get_ExpectAndReturn(test_vector.params.iv_index & 0x01, test_vector.params.iv_index);

        TEST_ASSERT_EQUAL(NRF_SUCCESS, network_pkt_in(p_net_packet, NULL));
        TEST_ASSERT_NOT_NULL(p_transport_pkt_in_previous);

        TEST_ASSERT_EQUAL(0, m_net_secmat_get_calls_expect);

        TEST_ASSERT_EQUAL_MEMORY(test_vector.p_header_data,     &p_transport_pkt_in_previous->header, test_vector.lengths.header);
        TEST_ASSERT_EQUAL_MEMORY(test_vector.p_transport_packet, p_transport_pkt_in_previous->payload, test_vector.lengths.transport);

        packet_mgr_decref(p_packet);
    }
}

void test_self_receive(void)
{
    const uint8_t run_testvectors[] = SELF_RECEIVE_TEST_VECTORS;
    provision(true);

    mp_net_secmats = &test_network;
    m_net_secmat_count = 1;

    for(unsigned int i = 0; i < sizeof(run_testvectors); ++i)
    {
        test_vector_t test_vector;
        get_test_vector(run_testvectors[i], &test_vector);

        packet_t * p_packet = NULL;
        packet_net_t* p_net_packet = construct_in_packet(&p_packet, test_vector.p_encrypted_packet, test_vector.lengths.encrypted);

        m_rx_address = test_vector.params.source;
        m_net_secmat_get_calls_expect = 1;

        msg_cache_entry_exists_IgnoreAndReturn(false);
        net_state_rx_iv_index_get_ExpectAndReturn(test_vector.params.iv_index & 0x01, test_vector.params.iv_index);

        TEST_ASSERT_EQUAL(NRF_SUCCESS, network_pkt_in(p_net_packet, NULL));

        TEST_ASSERT_EQUAL(0, m_net_secmat_get_calls_expect);

        packet_mgr_decref(p_packet);
    }
}

void test_packet_out(void)
{
    const uint8_t run_testvectors[] = NETWORK_PKT_OUT_TEST_VECTORS;
    provision(true);
    m_bearer_tx_return = NRF_SUCCESS;
    bearer_tx_StubWithCallback(bearer_tx_mock_cb);

    /* Processes all the test vectors as outbound packets. */
    for(unsigned int i = 0; i < sizeof(run_testvectors[i]); ++i)
    {
        test_vector_t test_vector;
        get_test_vector(run_testvectors[i], &test_vector);
        __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "Running test vector %d\n", run_testvectors[i]);

        packet_t * p_packet = NULL;
        construct_out_packet(&p_packet, test_vector.p_transport_packet, test_vector.lengths.transport, &test_vector.params);

        bearer_tx_mock_reset();

        net_state_tx_iv_index_get_ExpectAndReturn(test_vector.params.iv_index);

        TEST_ASSERT_EQUAL(NRF_SUCCESS, network_pkt_out(p_packet, &test_network, true));
        TEST_ASSERT_NOT_NULL(p_bearer_tx_previous);

        packet_net_t * p_transport_pkt = packet_net_packet_get(p_bearer_tx_previous);
        TEST_ASSERT_EQUAL_MEMORY(test_vector.p_encrypted_packet, &p_transport_pkt->header, test_vector.lengths.encrypted);
    }

    /* Fail sending */
    m_bearer_tx_return = 0x12345678;
    for(unsigned int i = 0; i < sizeof(run_testvectors[i]); ++i)
    {
        test_vector_t test_vector;
        get_test_vector(run_testvectors[i], &test_vector);
        __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "Running test vector %d\n", run_testvectors[i]);

