paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/test/src/ut_network.c
        packet_t * p_packet = NULL;
        construct_out_packet(&p_packet, test_vector.p_transport_packet, test_vector.lengths.transport, &test_vector.params);

        bearer_tx_mock_reset();

        net_state_tx_iv_index_get_ExpectAndReturn(test_vector.params.iv_index);

        TEST_ASSERT_EQUAL(0x12345678, network_pkt_out(p_packet, &test_network, true));
        TEST_ASSERT_NOT_NULL(p_bearer_tx_previous);

        packet_net_t * p_transport_pkt = packet_net_packet_get(p_bearer_tx_previous);
        TEST_ASSERT_EQUAL_MEMORY(test_vector.p_encrypted_packet, &p_transport_pkt->header, test_vector.lengths.encrypted);
    }
}

void test_invalid_net_key_in(void)
{
    const uint8_t run_testvectors[] = INVALID_NETKEY_TEST_VECTORS;

    provision(false);

    transport_pkt_in_StubWithCallback(transport_pkt_in_mock_cb);

    mp_net_secmats = &test_network;
    m_net_secmat_count = 1;

    /* Processes all the test vectors as incoming packets. */
    for(unsigned int i = 0; i < sizeof(run_testvectors); ++i)
    {
        test_vector_t test_vector;
        get_test_vector(run_testvectors[i], &test_vector);

        packet_t * p_packet = NULL;
        packet_net_t* p_net_packet = construct_in_packet(&p_packet, test_vector.p_encrypted_packet, test_vector.lengths.encrypted);

        net_state_rx_iv_index_get_ExpectAndReturn(test_vector.params.iv_index & 0x01, test_vector.params.iv_index);

        m_net_secmat_get_calls_expect = 2;

        transport_pkt_in_mock_reset();
        TEST_ASSERT_EQUAL(NRF_SUCCESS, network_pkt_in(p_net_packet, NULL));
        TEST_ASSERT_NULL(p_transport_pkt_in_previous);

        TEST_ASSERT_EQUAL(0, m_net_secmat_get_calls_expect);

        packet_mgr_decref(p_packet);
    }
}

void test_relay(void)
{
    const uint8_t run_testvectors[] = NETWORK_PKT_RELAY_TEST_VECTORS;
    provision(true);
    m_bearer_tx_return = NRF_SUCCESS;

    bearer_tx_StubWithCallback(bearer_tx_mock_cb);

    /* Processes all the test vectors as outbound packets. */
    for(unsigned int i = 0; i < sizeof(run_testvectors); ++i)
    {
        test_vector_t test_vector;
        get_test_vector(run_testvectors[i], &test_vector);
        __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "Running test vector %d\n", run_testvectors[i]);

        packet_t * p_packet = NULL;
        test_vector.params.ttl++; // to get match on encrypted packet
        packet_net_t * p_net_packet = construct_out_packet(&p_packet, test_vector.p_transport_packet, test_vector.lengths.transport, &test_vector.params);

        if(test_vector.params.ttl >= 2)
        {
            net_state_rx_iv_index_get_ExpectAndReturn(test_vector.params.iv_index & 0x01, test_vector.params.iv_index);
        }

        bearer_tx_mock_reset();

        TEST_ASSERT_EQUAL(NRF_SUCCESS, network_pkt_relay(p_net_packet, &test_network));

        if(test_vector.params.ttl >= 2)
        {
            /* Check that packets with TTL >= 2 is relayed. */
            TEST_ASSERT_NOT_NULL(p_bearer_tx_previous);
            TEST_ASSERT_EQUAL_MEMORY(test_vector.p_encrypted_packet, &((packet_net_t *) p_bearer_tx_previous->payload)->header, test_vector.lengths.header);
        }
        else
        {
            /* Check that packets with TTL <= 1 is not relayed. */
            TEST_ASSERT_NULL(p_bearer_tx_previous);
        }
    }
    /* Now fail TX */
    m_bearer_tx_return = 0x12345678;
    for(unsigned int i = 0; i < sizeof(run_testvectors); ++i)
    {
        test_vector_t test_vector;
        get_test_vector(run_testvectors[i], &test_vector);
        __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "Running test vector %d\n", run_testvectors[i]);

        packet_t * p_packet = NULL;
        test_vector.params.ttl++; // to get match on encrypted packet
        packet_net_t * p_net_packet = construct_out_packet(&p_packet, test_vector.p_transport_packet, test_vector.lengths.transport, &test_vector.params);

        bearer_tx_mock_reset();

        if(test_vector.params.ttl >= 2)
        {
            net_state_rx_iv_index_get_ExpectAndReturn(test_vector.params.iv_index & 0x01, test_vector.params.iv_index);
            TEST_ASSERT_EQUAL(m_bearer_tx_return, network_pkt_relay(p_net_packet, &test_network));

            /* Check that packets with TTL >= 2 is relayed. */
            TEST_ASSERT_NOT_NULL(p_bearer_tx_previous);
            TEST_ASSERT_EQUAL_MEMORY(test_vector.p_encrypted_packet, &((packet_net_t *) p_bearer_tx_previous->payload)->header, test_vector.lengths.header);
        }
        else
        {
            TEST_ASSERT_EQUAL(NRF_SUCCESS, network_pkt_relay(p_net_packet, &test_network));

            /* Check that packets with TTL <= 1 is not relayed. */
            TEST_ASSERT_NULL(p_bearer_tx_previous);
        }
    }
}

void test_app_cb_relay(void)
{
    nrf_mesh_init_params_t init_params;
    init_params.relay_cb = relay_cb;
    net_state_init_Expect();
    net_beacon_init_Expect();
    net_state_recover_from_flash_Expect();
    network_init(&init_params);

    const uint8_t run_testvectors[] = NETWORK_PKT_RELAY_TEST_VECTORS;
    provision(true);

    bearer_tx_StubWithCallback(bearer_tx_mock_cb);

    /* Processes all the test vectors as outbound packets. */
    for(unsigned int i = 0; i < sizeof(run_testvectors); ++i)
    {
        test_vector_t test_vector;
        get_test_vector(run_testvectors[i], &test_vector);
        __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "Running test vector %d\n", run_testvectors[i]);

        packet_t * p_packet = NULL;
        packet_net_t * p_net_packet = construct_out_packet(&p_packet, test_vector.p_transport_packet, test_vector.lengths.transport, &test_vector.params);

        if (test_vector.params.ttl >= 2)
        {
            m_relay_expected = 1;
            m_relay_dst = test_vector.params.dest;
            m_relay_src = test_vector.params.source;
            m_relay_ttl = test_vector.params.ttl;
            m_relay_return = i % 2; // only relay half of the packets.
            if (m_relay_return)
            {
                net_state_rx_iv_index_get_ExpectAndReturn(test_vector.params.iv_index & 0x01, test_vector.params.iv_index);
            }
        }
        else
        {
            m_relay_expected = 0;
        }

        bearer_tx_mock_reset();

        TEST_ASSERT_EQUAL(NRF_SUCCESS, network_pkt_relay(p_net_packet, &test_network));

        TEST_ASSERT_EQUAL(0, m_relay_expected);

        if(test_vector.params.ttl >= 2 && m_relay_return)
        {
            /* Check that packets with TTL >= 2 is relayed. */
            TEST_ASSERT_NOT_NULL(p_bearer_tx_previous);
            // Contents not important
        }
        else
        {
            /* Check that packets with TTL <= 1 is not relayed. */
            TEST_ASSERT_NULL(p_bearer_tx_previous);
        }
    }
}

